Revit 2024 API
AnalysisDisplayColorSettings.Colors Method
 Get number of colors, including min, max and intermediate.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public int Colors()
Visual Basic
Public Function Colors As Integer
Visual C++
public:
int Colors()
Return Value
 Number of colors, including min, max and intermediate.
See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace